//Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
//и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Задача 10 ");
int a = 321;
string strnum = Convert.ToString(a);
Console.WriteLine("вторая цифра этого числа - "+strnum[1]);